# Brewfile - Complete package list

# Taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"

# Version Manager (replaces nvm, rustup for versions, etc.)
brew "mise"

# Dotfiles Manager
brew "chezmoi"

# Core Development Tools
brew "neovim"
brew "git"
brew "gh"
brew "tmux"

# Shell & Prompt
brew "starship"  # Fast, minimal prompt (replaces oh-my-zsh + oh-my-posh)

# Search & Navigation
brew "ripgrep"   # Fast grep (rg)
brew "fd"        # Fast find (fd)
brew "fzf"       # Fuzzy finder
brew "eza"       # Modern ls replacement
brew "bat"       # Better cat with syntax highlighting
brew "zoxide"    # Smarter cd

# Languages & Runtimes - ALL managed by mise, not Homebrew!
# See mise/config.toml for version configuration

# Database
brew "sqlite"

# Container Tools
brew "docker"          # Docker CLI
brew "docker-compose"  # Docker Compose

# Security
brew "1password-cli"

# Fonts (for terminal)
cask "font-fira-code-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-jetbrains-mono-nerd-font"

# GUI Apps
cask "ghostty"         # Modern terminal
cask "1password"

# Optional but useful
brew "tree"
brew "jq"
brew "wget"
brew "curl"
